app/controllers/posts_controller.rb

SELECT "posts".* FROM "posts"
SELECT DISTINCT "posts"."category" FROM "posts"
SELECT "posts".* FROM "posts" WHERE "posts"."category" = ?  [["category", "Landscape"]]
---
  def index
    @post = Post.all
    @category = Post.uniq.pluck(:category)

    if params[:category]
      @post = Post.where(:category => params[:category])

INSERT INTO "posts" ("title", "category", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["title", "Test"], ["category", "Landscape"], ["created_at", "2016-02-19 06:39:04.275569"], ["updated_at", "2016-02-19 06:39:04.275569"]]
---
  def create
    @post = Post.new post_params
    if @post.save

UPDATE "posts" SET "image_updated_at" = ?, "image_file_size" = ?, "image_file_name" = ?, "updated_at" = ? WHERE "posts"."id" = ?  [["image_updated_at", "2016-02-28 03:12:28.675894"], ["image_file_size", 3123178], ["image_file_name", "16731039014_ea45265b20_o.jpg"], ["updated_at", "2016-02-28 03:12:33.981763"], ["id", 4]]
---
  def update
    if @post.update post_params

SELECT  "posts".* FROM "posts" WHERE "posts"."title" = ? LIMIT 1  [["title", "Naples"]]
---
  def find_post
    @post = Post.find_by_title(params[:id])