app/controllers/posts_controller.rb

  def find_post
    @post = Post.find(params[:id])
---
SELECT  "posts".* FROM "posts" WHERE (id < 3)  ORDER BY "posts"."id" DESC LIMIT 1