app/controllers/static_pages_controller.rb

SELECT "posts".* FROM "posts" WHERE "posts"."main_page" = ?  [["main_page", "t"]]
---
  def index
    @post = Post.where(main_page: true)